{"stop": 1, "in": 2, "a": 3, "python": 4, "to": 5, "'": 6, "how": 7, "1": 8, "0": 9, "for": 10, "of": 11, "with": 12, "i": 13, "from": 14, "x": 15, "list": 16, "self": 17, "2": 18, "the": 19, "def": 20, "print": 21, "pass": 22, "import": 23, "if": 24, "return": 25, "data": 26, "s": 27, "np": 28, "and": 29, "file": 30, "3": 31, "get": 32, "using": 33, "string": 34, "array": 35, "is": 36, "name": 37, "df": 38, "numpy": 39, "as": 40, "b": 41, "y": 42, "django": 43, "class": 44, "value": 45, "set": 46, "n": 47, "5": 48, "do": 49, "f": 50, "pandas": 51, "on": 52, "4": 53, "key": 54, "an": 55, "can": 56, "c": 57, "d": 58, "values": 59, "line": 60, "range": 61, "text": 62, "true": 63, "all": 64, "index": 65, "path": 66, "plt": 67, "function": 68, "add": 69, "matplotlib": 70, "len": 71, "request": 72, "open": 73, "time": 74, "find": 75, "10": 76, "os": 77, "dataframe": 78, "none": 79, "way": 80, "dict": 81, "object": 82, "datetime": 83, "by": 84, "into": 85, "t": 86, "random": 87, "not": 88, "multiple": 89, "p": 90, "read": 91, "k": 92, "plot": 93, "dictionary": 94, "two": 95, "use": 96, "append": 97, "image": 98, "split": 99, "args": 100, "that": 101, "item": 102, "column": 103, "url": 104, "row": 105, "or": 106, "create": 107, "number": 108, "r": 109, "sys": 110, "format": 111, "result": 112, "m": 113, "app": 114, "user": 115, "ax": 116, "str": 117, "json": 118, "my": 119, "re": 120, "6": 121, "convert": 122, "write": 123, "it": 124, "l": 125, "pd": 126, "join": 127, "columns": 128, "one": 129, "init": 130, "'a'": 131, "id": 132, "items": 133, "test": 134, "new": 135, "model": 136, "date": 137, "int": 138, "files": 139, "variable": 140, "v": 141, "csv": 142, "lambda": 143, "size": 144, "false": 145, "8": 146, "foo": 147, "''": 148, "output": 149, "without": 150, "module": 151, "lists": 152, "show": 153, "start": 154, "make": 155, "type": 156, "count": 157, "7": 158, "input": 159, "element": 160, "sum": 161, "'b'": 162, "while": 163, "parse": 164, "kwargs": 165, "elements": 166, "response": 167, "main": 168, "method": 169, "max": 170, "table": 171, "run": 172, "models": 173, "axis": 174, "objects": 175, "html": 176, "loop": 177, "remove": 178, "keys": 179, "map": 180, "matrix": 181, "flask": 182, "check": 183, "strings": 184, "group": 185, "root": 186, "filename": 187, "there": 188, "stdout": 189, "out": 190, "j": 191, "color": 192, "word": 193, "100": 194, "zip": 195, "replace": 196, "z": 197, "subprocess": 198, "close": 199, "logging": 200, "code": 201, "9": 202, "save": 203, "process": 204, "script": 205, "g": 206, "rows": 207, "db": 208, "else": 209, "w": 210, "shape": 211, "when": 212, "regex": 213, "match": 214, "sort": 215, "length": 216, "filter": 217, "default": 218, "bar": 219, "you": 220, "order": 221, "sqlalchemy": 222, "obj": 223, "at": 224, "urllib": 225, "first": 226, "between": 227, "numbers": 228, "field": 229, "fig": 230, "lines": 231, "another": 232, "same": 233, "query": 234, "parser": 235, "change": 236, "custom": 237, "e": 238, "only": 239, "xml": 240, "based": 241, "'c'": 242, "variables": 243, "n'": 244, "each": 245, "are": 246, "other": 247, "arrays": 248, "specific": 249, "tuple": 250}