{"unique": 1, "symbol": 2, "border": 3, "in": 4, "a": 5, "python": 6, "to": 7, "'": 8, "how": 9, "1": 10, "0": 11, "for": 12, "of": 13, "with": 14, "i": 15, "from": 16, "x": 17, "self": 18, "list": 19, "2": 20, "the": 21, "def": 22, "print": 23, "pass": 24, "import": 25, "if": 26, "return": 27, "data": 28, "s": 29, "np": 30, "and": 31, "file": 32, "3": 33, "get": 34, "using": 35, "string": 36, "array": 37, "is": 38, "name": 39, "df": 40, "numpy": 41, "as": 42, "b": 43, "y": 44, "class": 45, "django": 46, "value": 47, "set": 48, "5": 49, "do": 50, "n": 51, "4": 52, "f": 53, "pandas": 54, "c": 55, "on": 56, "key": 57, "an": 58, "can": 59, "d": 60, "values": 61, "line": 62, "range": 63, "text": 64, "true": 65, "path": 66, "index": 67, "all": 68, "plt": 69, "function": 70, "add": 71, "matplotlib": 72, "request": 73, "len": 74, "open": 75, "find": 76, "time": 77, "10": 78, "os": 79, "none": 80, "dataframe": 81, "datetime": 82, "way": 83, "dict": 84, "object": 85, "into": 86, "by": 87, "random": 88, "t": 89, "not": 90, "multiple": 91, "read": 92, "p": 93, "plot": 94, "dictionary": 95, "use": 96, "k": 97, "two": 98, "image": 99, "append": 100, "split": 101, "args": 102, "row": 103, "that": 104, "item": 105, "create": 106, "url": 107, "column": 108, "or": 109, "sys": 110, "r": 111, "number": 112, "app": 113, "format": 114, "user": 115, "m": 116, "result": 117, "str": 118, "re": 119, "ax": 120, "json": 121, "6": 122, "my": 123, "convert": 124, "write": 125, "init": 126, "l": 127, "it": 128, "join": 129, "pd": 130, "'a'": 131, "new": 132, "date": 133, "one": 134, "columns": 135, "id": 136, "test": 137, "items": 138, "int": 139, "model": 140, "files": 141, "variable": 142, "v": 143, "csv": 144, "lambda": 145, "size": 146, "false": 147, "''": 148, "8": 149, "foo": 150, "without": 151, "output": 152, "module": 153, "lists": 154, "show": 155, "start": 156, "make": 157, "count": 158, "type": 159, "7": 160, "input": 161, "element": 162, "'b'": 163, "while": 164, "sum": 165, "kwargs": 166, "parse": 167, "elements": 168, "main": 169, "response": 170, "method": 171, "max": 172, "table": 173, "run": 174, "axis": 175, "models": 176, "objects": 177, "html": 178, "remove": 179, "keys": 180, "map": 181, "flask": 182, "loop": 183, "group": 184, "matrix": 185, "strings": 186, "check": 187, "root": 188, "filename": 189, "stdout": 190, "j": 191, "there": 192, "color": 193, "out": 194, "word": 195, "100": 196, "replace": 197, "zip": 198, "z": 199, "subprocess": 200, "close": 201, "code": 202, "9": 203, "logging": 204, "save": 205, "db": 206, "else": 207, "script": 208, "process": 209, "g": 210, "w": 211, "rows": 212, "shape": 213, "match": 214, "when": 215, "regex": 216, "sort": 217, "you": 218, "default": 219, "filter": 220, "order": 221, "length": 222, "first": 223, "at": 224, "urllib": 225, "sqlalchemy": 226, "obj": 227, "bar": 228, "numbers": 229, "lines": 230, "between": 231, "fig": 232, "field": 233, "same": 234, "query": 235, "another": 236, "parser": 237, "change": 238, "e": 239, "custom": 240, "'c'": 241, "based": 242, "only": 243, "xml": 244, "variables": 245, "are": 246, "n'": 247, "each": 248, "other": 249, "arrays": 250, "float": 251, "some": 252, "tuple": 253, "s'": 254, "specific": 255, "window": 256, "this": 257, "search": 258, "client": 259, "scipy": 260, "end": 261, "any": 262, "requests": 263, "post": 264, "label": 265, "sub": 266, "form": 267, "update": 268, "google": 269, "words": 270, "command": 271, "func": 272, "call": 273, "access": 274, "log": 275, "be": 276, "server": 277, "frame": 278, "integer": 279, "groupby": 280, "template": 281, "20": 282, "num": 283, "within": 284, "non": 285, "content": 286, "instance": 287, "session": 288, "names": 289, "send": 290, "sorted": 291, "'http": 292, "socket": 293, "creating": 294, "library": 295, "next": 296, "what": 297, "different": 298, "page": 299, "given": 300, "fields": 301, "txt'": 302, "tkinter": 303, "engine": 304, "current": 305, "after": 306, "getting": 307, "last": 308, "arguments": 309, "unicode": 310, "api": 311, "dtype": 312, "h": 313, "base": 314, "select": 315, "itertools": 316, "message": 317, "yield": 318, "where": 319, "tree": 320, "http": 321, "finding": 322, "arange": 323, "series": 324, "nested": 325, "12": 326, "over": 327, "argument": 328, "beautifulsoup": 329, "load": 330, "characters": 331, "col": 332, "img": 333, "generate": 334, "windows": 335, "extract": 336, "context": 337, "insert": 338, "apply": 339, "results": 340, "single": 341, "application": 342, "execute": 343, "possible": 344, "points": 345, "node": 346, "many": 347, "width": 348, "val": 349, "ctypes": 350, "enumerate": 351, "display": 352, "view": 353, "admin": 354, "2d": 355, "idx": 356, "com": 357, "figure": 358, "multiprocessing": 359, "min": 360, "large": 361, "super": 362, "arr": 363, "example": 364, "copy": 365, "connect": 366, "password": 367, "like": 368, "functions": 369, "through": 370, "error": 371, "event": 372, "directory": 373, "efficient": 374, "selenium": 375, "indices": 376, "nan": 377, "title": 378, "im": 379, "cursor": 380, "tag": 381, "raise": 382, "pool": 383, "info": 384, "soup": 385, "'r'": 386, "'w'": 387, "tuples": 388, "headers": 389, "dictionaries": 390, "q": 391, "lst": 392, "py": 393, "parent": 394, "res": 395, "now": 396, "dt": 397, "pattern": 398, "mask": 399, "than": 400, "up": 401, "argparse": 402, "compile": 403, "running": 404, "try": 405, "email": 406, "binary": 407, "strip": 408, "inside": 409, "'d'": 410, "grid": 411, "cv2": 412, "best": 413, "11": 414, "database": 415, "stdin": 416, "labels": 417, "pythonic": 418, "version": 419, "point": 420, "counter": 421, "converting": 422, "parsing": 423, "more": 424, "child": 425, "but": 426, "source": 427, "pipe": 428, "attribute": 429, "have": 430, "connection": 431, "cls": 432, "reading": 433, "'name'": 434, "graph": 435, "header": 436, "web": 437, "program": 438, "reshape": 439, "expression": 440, "character": 441, "simple": 442, "delete": 443, "break": 444, "popen": 445, "via": 446, "draw": 447, "product": 448, "pyplot": 449, "calculate": 450, "level": 451, "local": 452, "rest": 453, "no": 454, "thread": 455, "driver": 456, "global": 457, "iter": 458, "stream": 459, "findall": 460, "'foo'": 461, "does": 462, "zeros": 463, "has": 464, "except": 465, "signal": 466, "dir": 467, "config": 468, "sql": 469, "generator": 470, "decimal": 471, "help": 472, "doc": 473, "long": 474, "ip": 475, "logger": 476, "axes": 477, "isinstance": 478, "sequence": 479, "legend": 480, "pil": 481, "parameters": 482, "dates": 483, "conn": 484, "www": 485, "mean": 486, "reader": 487, "which": 488, "queue": 489, "fit": 490, "scrapy": 491, "1000": 492, "build": 493, "widget": 494, "button": 495, "50": 496, "subplot": 497, "most": 498, "fill": 499, "system": 500, "nltk": 501, "body": 502, "tf": 503, "sleep": 504, "loc": 505, "statement": 506, "framework": 507, "com'": 508, "argv": 509, "target": 510, "contains": 511, "3d": 512, "setup": 513, "equivalent": 514, "attributes": 515, "efficiently": 516, "255": 517, "merge": 518, "package": 519, "groups": 520, "settings": 521, "certain": 522, "1'": 523, "options": 524, "host": 525, "handler": 526, "handle": 527, "modules": 528, "exception": 529, "'x'": 530, "encoding": 531, "u": 532, "15": 533, "debug": 534, "folder": 535, "multi": 536, "exit": 537, "png'": 538, "regular": 539, "mode": 540, "pdf": 541, "task": 542, "webdriver": 543, "meta": 544, "iterable": 545, "cell": 546, "every": 547, "shell": 548, "slice": 549, "scatter": 550, "writer": 551, "math": 552, "assert": 553, "status": 554, "params": 555, "year": 556, "msg": 557, "pygame": 558, "reverse": 559, "'test": 560, "port": 561, "structure": 562, "height": 563, "csv'": 564, "30": 565, "16": 566, "images": 567, "store": 568, "detect": 569, "o": 570, "stderr": 571, "plotting": 572, "lxml": 573, "stop": 574, "00": 575, "something": 576, "collections": 577, "right": 578, "raw": 579, "algorithm": 580, "parameter": 581, "token": 582, "integers": 583, "render": 584, "setting": 585, "char": 586, "empty": 587, "var": 588, "compare": 589, "pos": 590, "property": 591, "etree": 592, "day": 593, "decorator": 594, "username": 595, "style": 596, "decode": 597, "implement": 598, "excel": 599, "df2": 600, "combinations": 601, "browser": 602, "memory": 603, "month": 604, "common": 605, "entry": 606, "stringio": 607, "auth": 608, "encode": 609, "subplots": 610, "login": 611, "8'": 612, "removing": 613, "opencv": 614, "unittest": 615, "iterate": 616, "'utf": 617, "methods": 618, "adding": 619, "timedelta": 620, "writing": 621, "colors": 622, "25": 623, "timeit": 624, "work": 625, "left": 626, "eval": 627, "its": 628, "dynamically": 629, "fast": 630, "contents": 631, "queryset": 632, "console": 633, "celery": 634, "address": 635, "getattr": 636, "df1": 637, "operator": 638, "'bar'": 639, "bytes": 640, "lower": 641, "imshow": 642, "tk": 643, "ipython": 644, "distance": 645, "total": 646, "timestamp": 647, "document": 648, "sparse": 649, "id'": 650, "your": 651, "seq": 652, "'id'": 653, "txt": 654, "mock": 655, "'hello": 656, "sample": 657, "sorting": 658, "chain": 659, "pack": 660, "tmp": 661, "tags": 662, "seconds": 663, "comprehension": 664, "pairs": 665, "pi": 666, "urls": 667, "'a": 668, "mylist": 669, "temp": 670, "proxy": 671, "hash": 672, "name'": 673, "top": 674, "link": 675, "transform": 676, "'my": 677, "condition": 678, "font": 679, "'rb'": 680, "put": 681, "instead": 682, "pickle": 683, "part": 684, "days": 685, "reduce": 686, "cols": 687, "static": 688, "zero": 689, "urlopen": 690, "defaultdict": 691, "valid": 692, "mysql": 693, "diff": 694, "timeout": 695, "dumps": 696, "io": 697, "second": 698, "opener": 699, "changing": 700, "train": 701, "location": 702, "download": 703, "'1'": 704, "position": 705, "html'": 706, "alpha": 707, "drop": 708, "callback": 709, "determine": 710, "difference": 711, "randint": 712, "dot": 713, "pop": 714, "state": 715, "timezone": 716, "keep": 717, "environ": 718, "option": 719, "struct": 720, "users": 721, "glob": 722, "tensorflow": 723, "stack": 724, "double": 725, "choice": 726, "pyqt": 727, "gtk": 728, "200": 729, "01": 730, "matching": 731, "making": 732, "dynamic": 733, "before": 734, "del": 735, "unit": 736, "'e'": 737, "need": 738, "canvas": 739, "maximum": 740, "repr": 741, "buffer": 742, "'y'": 743, "letter": 744, "ascii": 745, "route": 746, "block": 747, "printing": 748, "combine": 749, "13": 750}