{"unique": 1, "symbol": 2, "border": 3, "a": 4, "in": 5, "python": 6, "to": 7, "how": 8, "'": 9, "of": 10, "1": 11, "0": 12, "for": 13, "list": 14, "with": 15, "i": 16, "from": 17, "x": 18, "the": 19, "2": 20, "print": 21, "self": 22, "string": 23, "s": 24, "using": 25, "file": 26, "and": 27, "get": 28, "if": 29, "data": 30, "3": 31, "df": 32, "array": 33, "return": 34, "np": 35, "numpy": 36, "is": 37, "do": 38, "pandas": 39, "import": 40, "set": 41, "def": 42, "pass": 43, "matplotlib": 44, "can": 45, "an": 46, "value": 47, "y": 48, "on": 49, "values": 50, "django": 51, "b": 52, "name": 53, "5": 54, "4": 55, "d": 56, "key": 57, "as": 58, "plt": 59, "text": 60, "c": 61, "all": 62, "dataframe": 63, "index": 64, "line": 65, "f": 66, "way": 67, "plot": 68, "n": 69, "into": 70, "add": 71, "function": 72, "range": 73, "find": 74, "by": 75, "dict": 76, "class": 77, "path": 78, "dictionary": 79, "true": 80, "multiple": 81, "time": 82, "convert": 83, "two": 84, "datetime": 85, "split": 86, "os": 87, "column": 88, "k": 89, "use": 90, "10": 91, "create": 92, "len": 93, "re": 94, "write": 95, "join": 96, "ax": 97, "format": 98, "object": 99, "read": 100, "open": 101, "request": 102, "image": 103, "t": 104, "row": 105, "'a'": 106, "item": 107, "lambda": 108, "number": 109, "that": 110, "json": 111, "lists": 112, "columns": 113, "show": 114, "str": 115, "sys": 116, "my": 117, "random": 118, "append": 119, "none": 120, "6": 121, "not": 122, "one": 123, "or": 124, "axis": 125, "items": 126, "int": 127, "l": 128, "it": 129, "p": 130, "app": 131, "m": 132, "url": 133, "pd": 134, "variable": 135, "elements": 136, "date": 137, "csv": 138, "v": 139, "make": 140, "new": 141, "args": 142, "sum": 143, "r": 144, "''": 145, "'b'": 146, "remove": 147, "element": 148, "user": 149, "8": 150, "output": 151, "test": 152, "map": 153, "files": 154, "without": 155, "strings": 156, "7": 157, "result": 158, "init": 159, "check": 160, "sort": 161, "there": 162, "model": 163, "module": 164, "replace": 165, "keys": 166, "objects": 167, "run": 168, "regex": 169, "size": 170, "count": 171, "id": 172, "zip": 173, "foo": 174, "false": 175, "max": 176, "input": 177, "start": 178, "flask": 179, "close": 180, "group": 181, "table": 182, "parse": 183, "filter": 184, "color": 185, "stdout": 186, "logging": 187, "rows": 188, "matrix": 189, "type": 190, "subprocess": 191, "tkinter": 192, "script": 193, "save": 194, "loop": 195, "another": 196, "response": 197, "you": 198, "root": 199, "method": 200, "kwargs": 201, "tuple": 202, "'c'": 203, "first": 204, "same": 205, "numbers": 206, "groupby": 207, "z": 208, "html": 209, "change": 210, "sorted": 211, "main": 212, "at": 213, "window": 214, "between": 215, "out": 216, "9": 217, "when": 218, "match": 219, "specific": 220, "word": 221, "order": 222, "each": 223, "sub": 224, "based": 225, "process": 226, "bar": 227, "100": 228, "any": 229, "n'": 230, "lines": 231, "characters": 232, "while": 233, "only": 234, "unicode": 235, "float": 236, "g": 237, "shape": 238, "length": 239, "j": 240, "models": 241, "w": 242, "fig": 243, "variables": 244, "words": 245, "sqlalchemy": 246, "arrays": 247, "code": 248, "custom": 249, "are": 250, "what": 251, "default": 252, "integer": 253, "db": 254, "xml": 255, "different": 256, "frame": 257, "filename": 258, "2d": 259, "tuples": 260, "apply": 261, "creating": 262, "within": 263, "send": 264, "call": 265, "socket": 266, "query": 267, "update": 268, "this": 269, "parser": 270, "e": 271, "label": 272, "else": 273, "field": 274, "some": 275, "insert": 276, "non": 277, "requests": 278, "getting": 279, "arguments": 280, "post": 281, "single": 282, "series": 283, "command": 284, "s'": 285, "extract": 286, "argument": 287, "server": 288, "execute": 289, "search": 290, "be": 291, "select": 292, "form": 293, "where": 294, "obj": 295, "google": 296, "log": 297, "possible": 298, "urllib": 299, "dictionaries": 300, "finding": 301, "other": 302, "figure": 303, "end": 304, "func": 305, "super": 306, "names": 307, "access": 308, "over": 309, "template": 310, "after": 311, "'http": 312, "nested": 313, "engine": 314, "session": 315, "given": 316, "findall": 317, "converting": 318, "txt'": 319, "selenium": 320, "last": 321, "windows": 322, "library": 323, "scipy": 324, "dtype": 325, "20": 326, "12": 327, "arr": 328, "http": 329, "beautifulsoup": 330, "content": 331, "current": 332, "many": 333, "generate": 334, "3d": 335, "application": 336, "title": 337, "itertools": 338, "character": 339, "display": 340, "pythonic": 341, "'d'": 342, "min": 343, "efficient": 344, "legend": 345, "directory": 346, "indices": 347, "connect": 348, "lst": 349, "next": 350, "delete": 351, "widget": 352, "grid": 353, "points": 354, "cursor": 355, "client": 356, "page": 357, "expression": 358, "num": 359, "fields": 360, "labels": 361, "width": 362, "load": 363, "img": 364, "argparse": 365, "through": 366, "tree": 367, "best": 368, "instance": 369, "h": 370, "raise": 371, "arange": 372, "sleep": 373, "driver": 374, "binary": 375, "message": 376, "copy": 377, "nan": 378, "draw": 379, "base": 380, "'foo'": 381, "reading": 382, "py": 383, "val": 384, "certain": 385, "regular": 386, "like": 387, "scatter": 388, "headers": 389, "compile": 390, "than": 391, "example": 392, "stdin": 393, "soup": 394, "reshape": 395, "tag": 396, "view": 397, "cv2": 398, "contains": 399, "most": 400, "admin": 401, "inside": 402, "more": 403, "large": 404, "results": 405, "strip": 406, "program": 407, "multiprocessing": 408, "database": 409, "context": 410, "pattern": 411, "enumerate": 412, "info": 413, "running": 414, "sorting": 415, "button": 416, "dt": 417, "parsing": 418, "have": 419, "decode": 420, "decimal": 421, "graph": 422, "loc": 423, "now": 424, "png'": 425, "comprehension": 426, "mean": 427, "api": 428, "functions": 429, "multi": 430, "but": 431, "removing": 432, "fill": 433, "up": 434, "plotting": 435, "com": 436, "signal": 437, "axes": 438, "'name'": 439, "simple": 440, "exit": 441, "popen": 442, "encode": 443, "pyplot": 444, "reverse": 445, "1'": 446, "mylist": 447, "attribute": 448, "im": 449, "col": 450, "password": 451, "email": 452, "subplot": 453, "product": 454, "pygame": 455, "calculate": 456, "'x'": 457, "merge": 458, "header": 459, "groups": 460, "level": 461, "does": 462, "thread": 463, "pool": 464, "ctypes": 465, "slice": 466, "'w'": 467, "error": 468, "debug": 469, "'utf": 470, "via": 471, "'bar'": 472, "equivalent": 473, "sql": 474, "config": 475, "'r'": 476, "pack": 477, "has": 478, "event": 479, "local": 480, "parent": 481, "pipe": 482, "11": 483, "reduce": 484, "system": 485, "no": 486, "8'": 487, "parameters": 488, "hex": 489, "'1'": 490, "pil": 491, "yield": 492, "connection": 493, "dir": 494, "which": 495, "imshow": 496, "df2": 497, "q": 498, "integers": 499, "source": 500, "web": 501, "version": 502, "mask": 503, "subplots": 504, "idx": 505, "dates": 506, "zeros": 507, "com'": 508, "pyqt": 509, "node": 510, "exception": 511, "'test": 512, "point": 513, "sequence": 514, "conn": 515, "efficiently": 516, "opencv": 517, "logger": 518, "shell": 519, "drop": 520, "attributes": 521, "rest": 522, "counter": 523, "modules": 524, "position": 525, "adding": 526, "statement": 527, "res": 528, "implement": 529, "bytes": 530, "detect": 531, "empty": 532, "writer": 533, "global": 534, "argv": 535, "csv'": 536, "encoding": 537, "'id'": 538, "every": 539, "canvas": 540, "formatting": 541, "child": 542, "condition": 543, "dumps": 544, "webdriver": 545, "www": 546, "'e'": 547, "long": 548, "eval": 549, "handle": 550, "writing": 551, "iter": 552, "render": 553, "mysql": 554, "settings": 555, "scrapy": 556, "timedelta": 557, "changing": 558, "ip": 559, "math": 560, "stream": 561, "ascii": 562, "setting": 563, "iterate": 564, "16": 565, "day": 566, "year": 567, "gtk": 568, "cell": 569, "combinations": 570, "compare": 571, "fit": 572, "generator": 573, "255": 574, "contents": 575, "second": 576, "package": 577, "common": 578, "15": 579, "help": 580, "something": 581, "right": 582, "'a": 583, "1000": 584, "framework": 585, "astype": 586, "folder": 587, "try": 588, "lxml": 589, "excel": 590, "iterable": 591, "'hello": 592, "lower": 593, "instead": 594, "df1": 595, "letters": 596, "dynamically": 597, "build": 598, "pdf": 599, "reader": 600, "its": 601, "console": 602, "50": 603, "raw": 604, "entry": 605, "assert": 606, "'my": 607, "combine": 608, "txt": 609, "chain": 610, "nltk": 611, "status": 612, "reset": 613, "browser": 614, "printing": 615, "store": 616, "mode": 617, "dot": 618, "plots": 619, "keep": 620, "struct": 621, "utf": 622, "isinstance": 623, "unittest": 624, "matching": 625, "name'": 626, "parameter": 627, "host": 628, "tf": 629, "mainloop": 630, "timestamp": 631, "double": 632, "images": 633, "break": 634, "put": 635, "options": 636, "top": 637, "colors": 638, "o": 639, "zero": 640, "30": 641, "savefig": 642, "'y'": 643, "your": 644, "part": 645, "dimensional": 646, "transform": 647, "determine": 648, "structure": 649, "handler": 650, "d'": 651, "bind": 652, "style": 653, "operator": 654, "duplicate": 655, "month": 656, "'2'": 657, "difference": 658, "doc": 659, "maximum": 660, "tk": 661, "work": 662, "address": 663, "containing": 664, "body": 665, "fastest": 666, "getattr": 667, "cls": 668, "pairs": 669, "stderr": 670, "seconds": 671, "timeout": 672, "queue": 673, "except": 674, "queryset": 675, "'date'": 676, "strftime": 677, "login": 678, "target": 679, "html'": 680, "height": 681, "timezone": 682, "decorator": 683, "xpath": 684, "passing": 685, "font": 686, "var": 687, "char": 688, "duplicates": 689, "tags": 690, "urlopen": 691, "port": 692, "ipython": 693, "fast": 694, "wx": 695, "exists": 696, "msg": 697, "redirect": 698, "download": 699, "etree": 700, "days": 701, "sample": 702, "making": 703, "memory": 704, "task": 705, "splitting": 706, "screen": 707, "left": 708, "link": 709, "colorbar": 710, "stop": 711, "pop": 712, "letter": 713, "'hello'": 714, "equal": 715, "'f'": 716, "choice": 717, "before": 718, "wait": 719, "hash": 720, "setup": 721, "background": 722, "why": 723, "total": 724, "layout": 725}